k6_final/results_linux_mssql/LinuxServerInsights_6h_result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /home/ubuntu/Load-Testing-Tool/k6_final/k6_dashboard_name/linux-mssql-dashboard/LinuxServerInsights.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 5 iterations shared among 5 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  █ TOTAL RESULTS 

    checks_total.......: 30      40.177695/s
    checks_succeeded...: 100.00% 30 out of 30
    checks_failed......: 0.00%   0 out of 30

    ✓ Dashboard is status 200
    ✓ Panel 9 (Alerts-Details) is status 200
    ✓ Panel 1 (Active Alerts Details) is status 200
    ✓ Panel 2 (Cleared Alerts Details) is status 200
    ✓ Panel 4 (Alert Rule Name based Percentile) is status 200
    ✓ Panel 3 (Summary Based Percentile View) is status 200

    CUSTOM
    dashboard_response_time........: avg=92.69ms  min=79.64ms  med=92.47ms  max=106.62ms p(90)=101.53ms p(95)=104.08ms
    dashboard_success_rate.........: 100.00% 5 out of 5
    panel_failure_rate_1...........: 0.00%   0 out of 5
    panel_failure_rate_2...........: 0.00%   0 out of 5
    panel_failure_rate_3...........: 0.00%   0 out of 5
    panel_failure_rate_4...........: 0.00%   0 out of 5
    panel_failure_rate_9...........: 0.00%   0 out of 5
    panel_response_time_1..........: avg=90.47ms  min=43.09ms  med=97.39ms  max=111.1ms  p(90)=110.81ms p(95)=110.95ms
    panel_response_time_2..........: avg=156.87ms min=112.67ms med=136.94ms max=211.04ms p(90)=202.41ms p(95)=206.72ms
    panel_response_time_3..........: avg=101.57ms min=91.8ms   med=104.57ms max=106.35ms p(90)=105.65ms p(95)=106ms   
    panel_response_time_4..........: avg=152.31ms min=92.81ms  med=178.58ms max=199.34ms p(90)=191.19ms p(95)=195.27ms
    panel_response_time_9..........: avg=99.27ms  min=36.91ms  med=115.31ms max=125.95ms p(90)=123.6ms  p(95)=124.78ms
    panel_success_rate_1...........: 100.00% 5 out of 5
    panel_success_rate_2...........: 100.00% 5 out of 5
    panel_success_rate_3...........: 100.00% 5 out of 5
    panel_success_rate_4...........: 100.00% 5 out of 5
    panel_success_rate_9...........: 100.00% 5 out of 5
    user_success_count.............: 25ms    33.48ms/s

    HTTP
    http_req_duration..............: avg=115.53ms min=36.91ms  med=106.49ms max=211.04ms p(90)=180.01ms p(95)=194.9ms 
      { expected_response:true }...: avg=115.53ms min=36.91ms  med=106.49ms max=211.04ms p(90)=180.01ms p(95)=194.9ms 
    http_req_duration_custom.......: avg=115.53ms min=36.91ms  med=106.49ms max=211.04ms p(90)=180.01ms p(95)=194.9ms 
    http_req_failed................: 0.00%   0 out of 30
    http_reqs......................: 30      40.177695/s

    EXECUTION
    iteration_duration.............: avg=709.63ms min=655.27ms med=742.92ms max=745.6ms  p(90)=745.28ms p(95)=745.44ms
    iterations.....................: 5       6.696282/s

    NETWORK
    data_received..................: 1.7 MB  2.3 MB/s
    data_sent......................: 11 kB   15 kB/s



running (00m00.7s), 0/5 VUs, 5 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  00m00.7s/10m0s  5/5 shared iters